AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеБезналичныхДенежныхСредств</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступлениеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоПлатежнымКартам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоБанковскимКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеСредствОтФСС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийППИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийППИсходящее</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписаниеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РазовоеИсправлениеКассыWayForPay/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// РАЗОВОЕ ИСПРАВЛЕНИЕ ОСТАТКА СЧЁТА «wayforpay» (БанковскиеСчета 000000074)
//
// Остаток счёта эквайринга должен быть нулём: всё, что покупатели платят через
// WayForPay, WayForPay раз в сутки выплачивает на «Р.с антон моно», и эти
// выплаты уже списаны с «wayforpay» переводами. На 15.09.2026 остаток был
// -8 139,82. Поштучная сверка с выгрузкой транзакций WayForPay (TRANSACTION_LIST:
// 141 оплата на 72 804,00 и возврат 150,00 - ровно сумма выплат) разложила его
// без остатка:
//
//  А. 25 оплат WayForPay проведены на чужие счета: 24 на «Р.с антон моно»
//     (000000071), одна на «Моно» (000000021). Кнопка WayForPay в форме заказа
//     регистрировала оплату на 071 - исправлено в
//     WayForPay.ПроверитьИЗарегистрироватьОплату. Переносим на «wayforpay»,
//     сумма, заказ и контрагент не меняются.                        +13 780,00
//  Б. 6 «Прочих поступлений» без заказа, с номером платежа, обрезанным до 15
//     символов, и за вычетом 1% - вторые экземпляры тех же оплат WayForPay
//     (настоящие - оплаты покупателей 26248, 26255, 26256, 26271 из пункта А
//     и 26287, 26289). Помечаем на удаление.                         -5 613,30
//  В. 6 оплат покупателей приняты за вычетом 1% «комиссии некарточного счёта»,
//     хотя комиссию платит покупатель. Возвращаем полную сумму.          +32,30
//  Г. Выплаты за 19.07 и 20.07 пришли за вычетом настоящей комиссии WayForPay
//     (тогда её платил магазин), и её не списали. Два «Прочих списания». -59,18
//                                                                     ---------
//                                                                         0,00
//
// Список документов зашит здесь, снаружи приходит только apply. Без apply =
// true не пишется ничего: по каждой строке возвращается «было -> станет» и
// ожидаемые остатки. Каждая строка сначала сверяется с тем, что видели при
// разборе (счёт, сумма, вид операции, номер платежа) - расхождение даёт отказ,
// а не правку. Повторный вызов безопасен: исправленные строки пропускаются.
//
// Вход - HTTPСервис.ТелеграмВебхук, действие "fixwfp"; на сайте
// assets/shop/fix_1c_wfp_cash.php. После применения модуль, ветку в сервисе
// и скрипт на сайте удалить.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Выполнить исправление либо показать, что оно сделает.
//
// Параметры:
//  Данные - Структура - разобранное тело команды, читается только apply.
//
// Возвращаемое значение:
//  Структура - ok, apply, saved, items, balances.
//
Функция ИсправитьКассу(Знач Данные) Экспорт

	// Пользователь публикации базы - служебный, прав на документы у него нет.
	// Канал защищён общим токеном, это и есть проверка «свой - чужой».
	УстановитьПривилегированныйРежим(Истина);

	Применять = Ложь;
	Данные.Свойство("apply", Применять);
	Применять = (Применять = Истина);

	Итог = Новый Структура;
	Итог.Вставить("ok",    Ложь);
	Итог.Вставить("apply", Применять);

	СчетЭквайринга = Справочники.БанковскиеСчета.НайтиПоКоду(КодСчетаЭквайринга());

	Если СчетЭквайринга.Пустая() Тогда
		Итог.Вставить("error", "не найден банковский счёт " + КодСчетаЭквайринга());
		Возврат Итог;
	КонецЕсли;

	ОстаткиДо = ОстаткиСчетов();

	Результаты = Новый Массив;

	Для Каждого Описание Из ОплатыНаЧужихСчетах() Цикл
		Результаты.Добавить(ПеренестиОплату(Описание, СчетЭквайринга, Применять));
	КонецЦикла;

	Для Каждого Описание Из ЛишниеПрочиеПоступления() Цикл
		Результаты.Добавить(ПометитьПрочееПоступление(Описание, СчетЭквайринга, Применять));
	КонецЦикла;

	Для Каждого Описание Из ОплатыЗаВычетомПроцента() Цикл
		Результаты.Добавить(ВернутьПолнуюСумму(Описание, СчетЭквайринга, Применять));
	КонецЦикла;

	Для Каждого Описание Из НесписанныеКомиссии() Цикл
		Результаты.Добавить(СписатьКомиссию(Описание, СчетЭквайринга, Применять));
	КонецЦикла;

	Записано = 0;

	Для Каждого Результат Из Результаты Цикл
		Если Результат.saved Тогда
			Записано = Записано + 1;
		КонецЕсли;
	КонецЦикла;

	ОстаткиПосле = ?(Применять, ОстаткиСчетов(), Неопределено);

	Итог.Вставить("ok",       Истина);
	Итог.Вставить("saved",    Записано);
	Итог.Вставить("items",    Результаты);
	Итог.Вставить("balances", СводкаОстатков(ОстаткиДо, ОстаткиПосле, Результаты));

	ЗаписатьВЖурнал(Применять, Результаты, Записано);

	Возврат Итог;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЧТО ИСПРАВЛЯЕМ

Функция КодСчетаЭквайринга()

	Возврат "000000074";

КонецФункции

// А. Оплаты WayForPay, проведённые на чужой счёт: номер, сумма, код счёта сейчас.
Функция ОплатыНаЧужихСчетах()

	Список = Новый Массив;

	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026248",  150,    "000000021")); // 32400
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026255", 1690,    "000000071")); // 32403
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026256",  150,    "000000071")); // 32406
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026271", 1955,    "000000071")); // 32435
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026357",  830,    "000000071")); // 32525
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026367", 2510,    "000000071")); // 32527
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026403",  150,    "000000071")); // 32561
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026410",  150,    "000000071")); // 32571
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026439",  150,    "000000071")); // 32591
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026449",  150,    "000000071")); // 32594
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026477",  150,    "000000071")); // 32622
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026482", 1845,    "000000071")); // 32653
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026532",  150,    "000000071")); // 32703
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026563",  150,    "000000071")); // 32727
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026592",  150,    "000000071")); // 32759
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026594",  150,    "000000071")); // 32758
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026605",  150,    "000000071")); // 32771
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026607", 2100,    "000000071")); // 32777
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026614",  150,    "000000071")); // 32784
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026617",  150,    "000000071")); // 32790
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026618",  150,    "000000071")); // 32793
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026627",  150,    "000000071")); // 32798
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026681",  150,    "000000071")); // 32842
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026687",  150,    "000000071")); // 32851
	Список.Добавить(Новый Структура("Номер, Сумма, КодСчета", "00000026689",  150,    "000000071")); // 32850

	Возврат Список;

КонецФункции

// Б. «Прочие поступления» - вторые экземпляры оплат: номер, сумма, номер платежа.
Функция ЛишниеПрочиеПоступления()

	Список = Новый Массив;

	Список.Добавить(Новый Структура("Номер, Сумма, НомерПлатежа", "00000026308", 1559.25, "32461_178470013"));
	Список.Добавить(Новый Структура("Номер, Сумма, НомерПлатежа", "00000026309",  148.5,  "32460_178466373"));
	Список.Добавить(Новый Структура("Номер, Сумма, НомерПлатежа", "00000026310",  148.5,  "32406_178436583"));
	Список.Добавить(Новый Структура("Номер, Сумма, НомерПлатежа", "00000026311", 1673.1,  "32403_178435657"));
	Список.Добавить(Новый Структура("Номер, Сумма, НомерПлатежа", "00000026312",  148.5,  "32400_178429119"));
	Список.Добавить(Новый Структура("Номер, Сумма, НомерПлатежа", "00000026315", 1935.45, "32435_178454021"));

	Возврат Список;

КонецФункции

// В. Оплаты покупателей за вычетом 1%: номер, сумма сейчас, полная сумма.
Функция ОплатыЗаВычетомПроцента()

	Список = Новый Массив;

	Список.Добавить(Новый Структура("Номер, Было, Станет", "00000026397",  148.5,  150)); // 32552 _adv
	Список.Добавить(Новый Структура("Номер, Было, Станет", "00000026405", 2455.2, 2480)); // 32565
	Список.Добавить(Новый Структура("Номер, Было, Станет", "00000026431",  148.5,  150)); // 32585 _adv
	Список.Добавить(Новый Структура("Номер, Было, Станет", "00000026436",  148.5,  150)); // 32590 _adv
	Список.Добавить(Новый Структура("Номер, Было, Станет", "00000026441",  148.5,  150)); // 32575 _adv
	Список.Добавить(Новый Структура("Номер, Было, Станет", "00000026466",  148.5,  150)); // 32616 _adv

	Возврат Список;

КонецФункции

// Г. Комиссия, удержанная WayForPay из выплаты: ключ (НомерВходящегоДокумента
// нового документа - по нему повторный вызов узнаёт, что списание уже есть),
// дата сразу за выплатой, сумма, номер и сумма самой выплаты.
Функция НесписанныеКомиссии()

	Список = Новый Массив;

	Список.Добавить(Новый Структура("Ключ, Дата, Сумма, НомерВыплаты, СуммаВыплаты, Текст",
		"WFP-FEE-2026-07-19", Дата(2026, 7, 20, 9, 1, 47), 29.85, "00000004245", 1960.15,
		"Комиссия WayForPay за 19.07.2026: оплат 1 990,00, выплачено 1 960,15"));

	Список.Добавить(Новый Структура("Ключ, Дата, Сумма, НомерВыплаты, СуммаВыплаты, Текст",
		"WFP-FEE-2026-07-20", Дата(2026, 7, 21, 8, 38, 17), 29.33, "00000004256", 1925.67,
		"Комиссия WayForPay за 20.07.2026: оплат 1 955,00, выплачено 1 925,67"));

	Возврат Список;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ШАГИ

Функция ПеренестиОплату(Знач Описание, Знач СчетЭквайринга, Знач Применять)

	Итог = НоваяСтрокаИтога("А", Описание.Номер);

	Ссылка = НайтиДокумент("ПлатежноеПоручениеВходящее", Описание.Номер, Итог);

	Если Ссылка = Неопределено Тогда
		Возврат Итог;
	КонецЕсли;

	Если Ссылка.СчетОрганизации = СчетЭквайринга Тогда
		Итог.ok      = Истина;
		Итог.skipped = "уже на счёте " + Строка(СчетЭквайринга);
		Возврат Итог;
	КонецЕсли;

	Итог.error = ПроверитьПроведенный(Ссылка, Описание.Сумма);

	Если ПустаяСтрока(Итог.error) И Ссылка.СчетОрганизации.Код <> Описание.КодСчета Тогда
		Итог.error = "документ на счёте " + Строка(Ссылка.СчетОрганизации)
			+ " (" + Ссылка.СчетОрганизации.Код + "), ожидался " + Описание.КодСчета;
	КонецЕсли;

	Если ПустаяСтрока(Итог.error) И Ссылка.Организация <> СчетЭквайринга.Владелец Тогда
		Итог.error = "организация документа " + Строка(Ссылка.Организация)
			+ " не владеет счётом " + Строка(СчетЭквайринга);
	КонецЕсли;

	Если Не ПустаяСтрока(Итог.error) Тогда
		Возврат Итог;
	КонецЕсли;

	Итог.change = "счёт " + Строка(Ссылка.СчетОрганизации) + " -> " + Строка(СчетЭквайринга)
		+ ", " + ФорматСуммы(Ссылка.СуммаДокумента) + ", " + Строка(Ссылка.ДокументОснование);

	ДобавитьДвижение(Итог, КодСчетаЭквайринга(), Ссылка.СуммаДокумента);
	ДобавитьДвижение(Итог, Описание.КодСчета, -Ссылка.СуммаДокумента);

	Если Применять Тогда

		Объект = Ссылка.ПолучитьОбъект();
		Объект.СчетОрганизации = СчетЭквайринга;

		Итог.error = ЗаписатьДокумент(Объект, РежимЗаписиДокумента.Проведение);

		Если Не ПустаяСтрока(Итог.error) Тогда
			Возврат Итог;
		КонецЕсли;

		Итог.saved = Истина;

	КонецЕсли;

	Итог.ok = Истина;

	Возврат Итог;

КонецФункции

Функция ПометитьПрочееПоступление(Знач Описание, Знач СчетЭквайринга, Знач Применять)

	Итог = НоваяСтрокаИтога("Б", Описание.Номер);

	Ссылка = НайтиДокумент("ПлатежноеПоручениеВходящее", Описание.Номер, Итог);

	Если Ссылка = Неопределено Тогда
		Возврат Итог;
	КонецЕсли;

	Если Ссылка.ПометкаУдаления Тогда
		Итог.ok      = Истина;
		Итог.skipped = "уже помечен на удаление";
		Возврат Итог;
	КонецЕсли;

	Итог.error = ПроверитьПроведенный(Ссылка, Описание.Сумма);

	Если ПустаяСтрока(Итог.error) И Ссылка.СчетОрганизации <> СчетЭквайринга Тогда
		Итог.error = "документ на счёте " + Строка(Ссылка.СчетОрганизации) + ", ожидался " + Строка(СчетЭквайринга);
	КонецЕсли;

	Если ПустаяСтрока(Итог.error) И Ссылка.ВидОперации <>
		Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств Тогда

		Итог.error = "вид операции «" + Строка(Ссылка.ВидОперации) + "», ожидалось прочее поступление";

	КонецЕсли;

	Если ПустаяСтрока(Итог.error) И СокрЛП(Ссылка.НомерВходящегоДокумента) <> Описание.НомерПлатежа Тогда
		Итог.error = "номер платежа «" + СокрЛП(Ссылка.НомерВходящегоДокумента) + "», ожидался " + Описание.НомерПлатежа;
	КонецЕсли;

	Если Не ПустаяСтрока(Итог.error) Тогда
		Возврат Итог;
	КонецЕсли;

	Итог.change = "пометка удаления (проведение снимется), " + ФорматСуммы(Ссылка.СуммаДокумента)
		+ ", платёж " + Описание.НомерПлатежа;

	ДобавитьДвижение(Итог, КодСчетаЭквайринга(), -Ссылка.СуммаДокумента);

	Если Применять Тогда

		Объект = Ссылка.ПолучитьОбъект();

		Итог.error = ЗаписатьДокумент(Объект, Неопределено);

		Если Не ПустаяСтрока(Итог.error) Тогда
			Возврат Итог;
		КонецЕсли;

		Итог.saved = Истина;

	КонецЕсли;

	Итог.ok = Истина;

	Возврат Итог;

КонецФункции

Функция ВернутьПолнуюСумму(Знач Описание, Знач СчетЭквайринга, Знач Применять)

	Итог = НоваяСтрокаИтога("В", Описание.Номер);

	Ссылка = НайтиДокумент("ПлатежноеПоручениеВходящее", Описание.Номер, Итог);

	Если Ссылка = Неопределено Тогда
		Возврат Итог;
	КонецЕсли;

	Если Ссылка.СуммаДокумента = Описание.Станет Тогда
		Итог.ok      = Истина;
		Итог.skipped = "сумма уже " + ФорматСуммы(Описание.Станет);
		Возврат Итог;
	КонецЕсли;

	Итог.error = ПроверитьПроведенный(Ссылка, Описание.Было);

	Если ПустаяСтрока(Итог.error) И Ссылка.СчетОрганизации <> СчетЭквайринга Тогда
		Итог.error = "документ на счёте " + Строка(Ссылка.СчетОрганизации) + ", ожидался " + Строка(СчетЭквайринга);
	КонецЕсли;

	Если ПустаяСтрока(Итог.error) И Ссылка.ВидОперации <>
		Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя Тогда

		Итог.error = "вид операции «" + Строка(Ссылка.ВидОперации) + "», ожидалась оплата покупателя";

	КонецЕсли;

	Если ПустаяСтрока(Итог.error) И Ссылка.РасшифровкаПлатежа.Количество() <> 1 Тогда
		Итог.error = "в расшифровке " + Формат(Ссылка.РасшифровкаПлатежа.Количество(), "ЧН=0; ЧГ=0")
			+ " строк, ожидалась одна";
	КонецЕсли;

	Если ПустаяСтрока(Итог.error) И Ссылка.РасшифровкаПлатежа[0].СуммаПлатежа <> Описание.Было Тогда
		Итог.error = "в расшифровке сумма " + ФорматСуммы(Ссылка.РасшифровкаПлатежа[0].СуммаПлатежа)
			+ ", ожидалась " + ФорматСуммы(Описание.Было);
	КонецЕсли;

	Если Не ПустаяСтрока(Итог.error) Тогда
		Возврат Итог;
	КонецЕсли;

	Итог.change = "сумма " + ФорматСуммы(Описание.Было) + " -> " + ФорматСуммы(Описание.Станет)
		+ ", " + Строка(Ссылка.РасшифровкаПлатежа[0].Сделка);

	ДобавитьДвижение(Итог, КодСчетаЭквайринга(), Описание.Станет - Описание.Было);

	Если Применять Тогда

		Объект = Ссылка.ПолучитьОбъект();

		Объект.СуммаДокумента = Описание.Станет;

		// Реквизит в коде не используется, но если в нём сумма до правки -
		// оставлять её расходиться с суммой документа незачем.
		Если Объект.СуммаДокументаБезПроцента = Описание.Было Тогда
			Объект.СуммаДокументаБезПроцента = Описание.Станет;
		КонецЕсли;

		СтрокаПлатежа = Объект.РасшифровкаПлатежа[0];

		// Валюта договора - гривна (курс 1), но пересчитываем пропорцией, а не
		// приравниваем: так верно и при любом курсе.
		СтрокаПлатежа.СуммаВзаиморасчетов = Окр(СтрокаПлатежа.СуммаВзаиморасчетов * Описание.Станет / Описание.Было, 2);
		СтрокаПлатежа.СуммаПлатежа        = Описание.Станет;

		// НДС в строке есть не у каждой редакции документа - отсутствие поля
		// не должно обрывать исправление посреди списка.
		Попытка
			СтрокаПлатежа.СуммаНДС = Окр(СтрокаПлатежа.СуммаНДС * Описание.Станет / Описание.Было, 2);
		Исключение
		КонецПопытки;

		Итог.error = ЗаписатьДокумент(Объект, РежимЗаписиДокумента.Проведение);

		Если Не ПустаяСтрока(Итог.error) Тогда
			Возврат Итог;
		КонецЕсли;

		Итог.saved = Истина;

	КонецЕсли;

	Итог.ok = Истина;

	Возврат Итог;

КонецФункции

Функция СписатьКомиссию(Знач Описание, Знач СчетЭквайринга, Знач Применять)

	Итог = НоваяСтрокаИтога("Г", Описание.Ключ);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Д.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее КАК Д
		|ГДЕ
		|	Д.НомерВходящегоДокумента = &Ключ
		|	И НЕ Д.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ключ", Описание.Ключ);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Итог.ok      = Истина;
		Итог.skipped = "списание уже есть: " + Строка(Выборка.Ссылка);
		Возврат Итог;
	КонецЕсли;

	// Сама выплата должна быть на месте и с той суммой, из которой считали
	// комиссию, - иначе списывать не из чего.
	Выплата = НайтиДокумент("ПлатежноеПоручениеИсходящее", Описание.НомерВыплаты, Итог);

	Если Выплата = Неопределено Тогда
		Итог.error = "выплата " + Описание.НомерВыплаты + ": " + Итог.error;
		Возврат Итог;
	КонецЕсли;

	Если Выплата.ПометкаУдаления
		Или Не Выплата.Проведен
		Или Выплата.СчетОрганизации <> СчетЭквайринга
		Или Выплата.СуммаДокумента <> Описание.СуммаВыплаты Тогда

		Итог.error = "выплата " + Строка(Выплата) + " не та: счёт " + Строка(Выплата.СчетОрганизации)
			+ ", сумма " + ФорматСуммы(Выплата.СуммаДокумента)
			+ ", ожидалась " + ФорматСуммы(Описание.СуммаВыплаты);

		Возврат Итог;

	КонецЕсли;

	Итог.change = "новое прочее списание " + ФорматСуммы(Описание.Сумма) + " от "
		+ Формат(Описание.Дата, "ДФ='dd.MM.yyyy HH:mm'") + " - " + Описание.Текст;

	ДобавитьДвижение(Итог, КодСчетаЭквайринга(), -Описание.Сумма);

	Если Применять Тогда

		// Заполнено так же, как прочие списания менеджеров в этой базе
		// (например 00000004326): без договора, только управленческий учёт,
		// статья «Прочие расходы денежных средств».
		Док = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();

		Док.Дата        = Описание.Дата;
		Док.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств;

		Док.Организация     = СчетЭквайринга.Владелец;
		Док.СчетОрганизации = СчетЭквайринга;

		Док.СуммаДокумента  = Описание.Сумма;
		Док.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("980");

		Док.Оплачено   = Истина;
		Док.ДатаОплаты = НачалоДня(Описание.Дата);

		Док.ОтражатьВУправленческомУчете = Истина;
		Док.ОтражатьВБухгалтерскомУчете  = Ложь;

		Док.СчетБанк = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВНациональнойВалюте;

		Док.НомерВходящегоДокумента = Описание.Ключ;
		Док.НазначениеПлатежа       = Описание.Текст;
		Док.Комментарий             = Описание.Текст + " (разовое исправление счёта wayforpay)";

		// Сеанс HTTP-сервиса: пользователь может быть не определён - тогда
		// ответственный остаётся пустым, а не роняет создание документа.
		Попытка
			Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Исключение
		КонецПопытки;

		СтрокаПлатежа = Док.РасшифровкаПлатежа.Добавить();

		СтрокаПлатежа.КурсВзаиморасчетов      = 1;
		СтрокаПлатежа.КратностьВзаиморасчетов = 1;
		СтрокаПлатежа.СуммаПлатежа            = Описание.Сумма;
		СтрокаПлатежа.СуммаВзаиморасчетов     = Описание.Сумма;

		СтрокаПлатежа.СтатьяДвиженияДенежныхСредств =
			Справочники.СтатьиДвиженияДенежныхСредств.ПрочиеРасходыДенежныхСредств;

		Итог.error = ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение);

		Если Не ПустаяСтрока(Итог.error) Тогда
			Возврат Итог;
		КонецЕсли;

		Итог.change = Итог.change + "; создан " + Строка(Док.Ссылка);
		Итог.saved  = Истина;

	КонецЕсли;

	Итог.ok = Истина;

	Возврат Итог;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция НоваяСтрокаИтога(Знач Шаг, Знач Документ)

	Итог = Новый Структура;
	Итог.Вставить("step",    Шаг);
	Итог.Вставить("doc",     Документ);
	Итог.Вставить("ok",      Ложь);
	Итог.Вставить("saved",   Ложь);
	Итог.Вставить("skipped", "");
	Итог.Вставить("error",   "");
	Итог.Вставить("change",  "");
	Итог.Вставить("moves",   Новый Массив);

	Возврат Итог;

КонецФункции

// Документ по номеру в пределах разбираемого периода. Номер у документов
// может повторяться по годам, поэтому ищем с датой и отказываемся при двух.
Функция НайтиДокумент(Знач ИмяДокумента, Знач Номер, Итог)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	Д.Ссылка КАК Ссылка
		|ИЗ
		|	Документ." + ИмяДокумента + " КАК Д
		|ГДЕ
		|	Д.Номер = &Номер
		|	И Д.Дата МЕЖДУ &Начало И &Конец";
	Запрос.УстановитьПараметр("Номер",  Номер);
	Запрос.УстановитьПараметр("Начало", Дата(2026, 7, 1));
	Запрос.УстановитьПараметр("Конец",  Дата(2026, 9, 30, 23, 59, 59));

	Выборка = Запрос.Выполнить().Выбрать();

	Если Не Выборка.Следующий() Тогда
		Итог.error = "документ " + Номер + " за июль-сентябрь 2026 не найден";
		Возврат Неопределено;
	КонецЕсли;

	Найденный = Выборка.Ссылка;

	Если Выборка.Следующий() Тогда
		Итог.error = "документов с номером " + Номер + " больше одного";
		Возврат Неопределено;
	КонецЕсли;

	Возврат Найденный;

КонецФункции

// Пустая строка, если документ проведён, не помечен и сумма та, что видели.
Функция ПроверитьПроведенный(Знач Ссылка, Знач Сумма)

	Если Ссылка.ПометкаУдаления Тогда
		Возврат "документ помечен на удаление";
	КонецЕсли;

	Если Не Ссылка.Проведен Тогда
		Возврат "документ не проведён";
	КонецЕсли;

	Если Ссылка.СуммаДокумента <> Сумма Тогда
		Возврат "сумма документа " + ФорматСуммы(Ссылка.СуммаДокумента) + ", ожидалась " + ФорматСуммы(Сумма);
	КонецЕсли;

	Возврат "";

КонецФункции

// Записать документ. Режим - РежимЗаписиДокумента.Проведение либо Неопределено
// для пометки удаления. Возвращает текст ошибки либо пустую строку.
Функция ЗаписатьДокумент(Объект, Знач Режим)

	// Проведение сообщает о причинах отказа через Сообщить - собираем их, иначе
	// снаружи было бы видно только «Операция не выполнена».
	ПолучитьСообщенияПользователю(Истина);

	Попытка

		Если Режим = Неопределено Тогда
			Объект.УстановитьПометкуУдаления(Истина);
		Иначе
			// Документы прошлых месяцев: оперативное проведение для них недоступно.
			Объект.Записать(Режим, РежимПроведенияДокумента.Неоперативный);
		КонецЕсли;

	Исключение

		Текст = ОписаниеОшибки();

		Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
			Текст = Текст + "; " + Сообщение.Текст;
		КонецЦикла;

		Возврат Текст;

	КонецПопытки;

	ПолучитьСообщенияПользователю(Истина);

	Возврат "";

КонецФункции

Процедура ДобавитьДвижение(Итог, Знач КодСчета, Знач Сумма)

	Итог.moves.Добавить(Новый Структура("code, sum", КодСчета, Сумма));

КонецПроцедуры

// Остатки по регистру ДенежныеСредства на затронутых счетах: код -> сумма.
Функция ОстаткиСчетов()

	Коды = Новый Массив;
	Коды.Добавить(КодСчетаЭквайринга());
	Коды.Добавить("000000071");
	Коды.Добавить("000000021");

	Счета = Новый Массив;

	Для Каждого Код Из Коды Цикл
		Счета.Добавить(Справочники.БанковскиеСчета.НайтиПоКоду(Код));
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.БанковскийСчетКасса КАК Счет,
		|	СУММА(Остатки.СуммаОстаток) КАК Остаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(, БанковскийСчетКасса В (&Счета)) КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.БанковскийСчетКасса";
	Запрос.УстановитьПараметр("Счета", Счета);

	Выгрузка = Запрос.Выполнить().Выгрузить();

	Остатки = Новый Соответствие;

	Для Индекс = 0 По Коды.ВГраница() Цикл

		Найденная = Выгрузка.Найти(Счета[Индекс], "Счет");
		Остатки.Вставить(Коды[Индекс], Новый Структура("name, sum",
			Строка(Счета[Индекс]), ?(Найденная = Неопределено, 0, Найденная.Остаток)));

	КонецЦикла;

	Возврат Остатки;

КонецФункции

// Остаток до, после (при записи - фактический, при проверке - ожидаемый
// по строкам, которые записались бы) и сколько ожидалось.
Функция СводкаОстатков(Знач ОстаткиДо, Знач ОстаткиПосле, Знач Результаты)

	Сводка = Новый Массив;

	Для Каждого Элемент Из ОстаткиДо Цикл

		Ожидается = Элемент.Значение.sum;

		Для Каждого Результат Из Результаты Цикл

			Если Не Результат.ok Или Не ПустаяСтрока(Результат.skipped) Тогда
				Продолжить;
			КонецЕсли;

			Для Каждого Движение Из Результат.moves Цикл
				Если Движение.code = Элемент.Ключ Тогда
					Ожидается = Ожидается + Движение.sum;
				КонецЕсли;
			КонецЦикла;

		КонецЦикла;

		СтрокаСводки = Новый Структура;
		СтрокаСводки.Вставить("code",     Элемент.Ключ);
		СтрокаСводки.Вставить("name",     Элемент.Значение.name);
		СтрокаСводки.Вставить("before",   Элемент.Значение.sum);
		СтрокаСводки.Вставить("expected", Ожидается);
		СтрокаСводки.Вставить("after",    ?(ОстаткиПосле = Неопределено, Ожидается, ОстаткиПосле.Получить(Элемент.Ключ).sum));

		Сводка.Добавить(СтрокаСводки);

	КонецЦикла;

	Возврат Сводка;

КонецФункции

Функция ФорматСуммы(Знач Сумма)

	Возврат Формат(Сумма, "ЧДЦ=2; ЧРД=,; ЧН=0,00");

КонецФункции

// Журнал - единственный след того, что документы меняли снаружи. Пишем и
// проверку тоже.
Процедура ЗаписатьВЖурнал(Знач Применять, Знач Результаты, Знач Записано)

	Текст = ?(Применять, "ЗАПИСЬ", "проверка без записи")
		+ ": разовое исправление счёта wayforpay, строк "
		+ Формат(Результаты.Количество(), "ЧН=0; ЧГ=0")
		+ ", записано документов " + Формат(Записано, "ЧН=0; ЧГ=0");

	Для Каждого Результат Из Результаты Цикл

		Текст = Текст + Символы.ПС + "  " + Результат.step + " " + Результат.doc + ": "
			+ ?(Не Результат.ok, "ОТКАЗ: " + Результат.error,
				?(ПустаяСтрока(Результат.skipped), Результат.change, Результат.skipped));

	КонецЦикла;

	ЗаписьЖурналаРегистрации("База.Запись",
		?(Применять, УровеньЖурналаРегистрации.Информация, УровеньЖурналаРегистрации.Примечание),
		Метаданные.Документы.ПлатежноеПоручениеВходящее, , Лев(Текст, 8000));

КонецПроцедуры
